# h = int(input("Часы: "))
# m = int(input("Минуты: "))
# s = int(input("Секунды: "))
# if 0 <= h <= 23 and 0 <= m <= 59 and 0 <= s <= 59:
#     print("Формат верный")
# else:
#     print("Формат не верный")
#     if h < 0 or h > 23:
#         print("Часы некорректны [0, 23]")
#     if m < 0 or m > 59:
#         print("Минуты некорректны [0, 59]")
#     else:
#         print("Секунды некорректны [0, 59")
count = 0
q1 = input("Планета Земля какакя по счёту(от Солнца)\n"
           "а) 2, б) 3, в) 4, г)5\n"
           "--> "
q2 = input("сколько \n"
           "а) 2, б) 3, в) 4, г)5\n"
           "--> "
q3 = input("\n"
           "а) 95, б) 107, в) 115, г)121\n"
           "--> "
           
